src/DataProcessors/УП_ПолучитьИндекс.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<DataProcessor>
		<Properties>
			<Name>УП_ПолучитьИндекс</Name>
		</Properties>
	</DataProcessor>
</MetaDataObject>

src/InformationRegisters/УП_ЦеныИнструментов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<InformationRegister>
		<Properties>
			<Name>УП_ЦеныИнструментов</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Цена</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Инструмент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УП_БиржевыеИнструменты</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

src/Catalogs/УП_Индексы.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>УП_Индексы</Name>
			<Comment>Биржевые индексы с составом входящих активов</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Тип</Name>
					<Type>
						<v8:Type>cfg:EnumRef.УП_ТипыИндексов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УП_БиржевыеИнструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Вес</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Catalogs/УП_Портфели.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>УП_Портфели</Name>
			<Comment>Произвольный набор активов пользователя</Comment>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Инструмент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.УП_БиржевыеИнструменты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>10</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/DataProcessors/УП_ПолучитьИндекс/Forms/Форма/Ext/Form/Module.bsl
#Область СлужебныеПроцедурыИФункции

// Функции для получения индексов данных из API Мосбиржи для индекса IMOEX
// Это позволяет в будущем, например, динамически определять эти индексы
// или централизованно управлять их значениями.
&НаСервереБезКонтекста
Функция _ИндексТикер_IMOEX()
    Возврат 2;
КонецФункции

&НаСервереБезКонтекста
Функция _ИндексНаименование_IMOEX()
    Возврат 3;
КонецФункции

&НаСервереБезКонтекста
Функция _ИндексВес_IMOEX()
    Возврат 5;
КонецФункции

// Функции для получения квалификаторов строк и чисел
&НаСервереБезКонтекста
Функция _ДлинаТикера()
    Возврат 10; // Увеличена для большей гибкости
КонецФункции

&НаСервереБезКонтекста
Функция _ДлинаНаименования()
    Возврат 50; // Увеличена для большей гибкости
КонецФункции

&НаСервереБезКонтекста
Функция _ДлинаВесаЦенаКоличество()
    Возврат 15; // Длина чисел
КонецФункции

&НаСервереБезКонтекста
Функция _ТочностьЦенаВес()
    Возврат 4;  // Точность для цен и весов
КонецФункции

// Описание вспомогательного объекта для возврата результатов вызовов API
&НаСервереБезКонтекста
Функция _ОписаниеРезультатаВызоваМетодаAPI()

	Результат = Новый Структура;

	Результат.Вставить("ПроизошлаОшибка", Ложь);
	Результат.Вставить("ТекстОшибки", 	  "");
	Результат.Вставить("Данные");
	Результат.Вставить("КодСостояния");
	Результат.Вставить("ОтветСервераТекст","");
	Результат.Вставить("ОбратнаяСвязь");

	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция _ФиксированныеДанные(Данные) Экспорт

  Если ТипЗнч(Данные) = Тип("Массив") Тогда

    Массив = Новый Массив;
    Для Каждого Значение Из Данные Цикл
      Если ТипЗнч(Значение) = Тип("Структура")
        ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
        ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
        Массив.Добавить(_ФиксированныеДанные(Значение));
      Иначе
        Массив.Добавить(Значение);
      КонецЕсли;
    КонецЦикла;

    Результат = Новый ФиксированныйМассив(Массив);
  ИначеЕсли ТипЗнч(Данные) = Тип("Структура")
    ИЛИ ТипЗнч(Данные) = Тип("Соответствие") Тогда

    Коллекция = Неопределено;
    Если ТипЗнч(Данные) = Тип("Структура") Тогда
      Коллекция = Новый Структура;
    Иначе
      Коллекция = Новый Соответствие;
    КонецЕсли;
    Для каждого КлючИЗначение Из Данные Цикл

      Значение = КлючИЗначение.Значение;
      Если ТипЗнч(Значение) = Тип("Структура")
        ИЛИ ТипЗнч(Значение) = Тип("Соответствие")
        ИЛИ ТипЗнч(Значение) = Тип("Массив") Тогда
        Коллекция.Вставить(КлючИЗначение.Ключ, _ФиксированныеДанные(Значение));
      Иначе
        Коллекция.Вставить(КлючИЗначение.Ключ, Значение);
      КонецЕсли;

    КонецЦикла;
    Если ТипЗнч(Данные) = Тип("Структура") Тогда
      Результат = Новый ФиксированнаяСтруктура(Коллекция);
    Иначе
      Результат = Новый ФиксированноеСоответствие(Коллекция);
    КонецЕсли;

  Иначе
    Результат = Данные;
  КонецЕсли;
  Возврат Результат;

КонецФункции

#Область _ОпределениеОшибок

&НаСервереБезКонтекста
Функция _HTTP_OK(КодСостояния)
	Возврат КодСостояния > 199 И КодСостояния < 300;
КонецФункции

&НаСервереБезКонтекста
Функция _HTTP_ОшибкаПараметров()
	Возврат 400;
КонецФункции

&НаСервереБезКонтекста
Функция _HTTP_ОшибкаАутентификации()
	Возврат 401;
КонецФункции

&НаСервереБезКонтекста
Функция _HTTP_ОшибкаДоступа()
	Возврат 403;
КонецФункции

&НаСервереБезКонтекста
Функция _HTTP_ОшибкаОбработкиДанных()
	Возврат 422;
КонецФункции

&НаСервереБезКонтекста
Функция _HTTP_СервисНедоступен()
	Возврат 502;
КонецФункции

#КонецОбласти

&НаСервереБезКонтекста
Функция _Коннектор(ПараметрыКлиента = Неопределено)
	// В реальной системе КЭДО_КоннекторКлиентСервер должен быть доступен
	// Например, через общий модуль или внешнюю компоненту
	Возврат Вычислить("УП_КоннекторHTTP");
КонецФункции

&НаСервереБезКонтекста
Функция _Хосты()

	Хосты = Новый Структура;
	Хосты.Вставить("API", "https://iss.moex.com");

	Возврат Хосты;
КонецФункции

&НаСервереБезКонтекста
Функция _ОписаниеОшибки(КодСостояния)

	ОписаниеОшибкиТекст = "Неизвестная ошибка";

	ОписаниеОшибки = Новый Соответствие;
	ОписаниеОшибки.Вставить(_HTTP_ОшибкаПараметров(), 	  "Неверный формат данных в запросе или отсутствуют обязательные параметры");
	ОписаниеОшибки.Вставить(_HTTP_ОшибкаАутентификации(), "Некорректный аутентификационный токен");
	ОписаниеОшибки.Вставить(_HTTP_ОшибкаДоступа(), 		  "Некорректный апи-ключ или недостаточно прав для вызова метода");
	ОписаниеОшибки.Вставить(_HTTP_ОшибкаОбработкиДанных(), "Ошибка обработки данных на сервере (некорректные данные или состояние)");
	ОписаниеОшибки.Вставить(_HTTP_СервисНедоступен(),     "Сервис временно недоступен или находится в процессе обновления");

	ОписаниеОшибкиТекстСоответствия = ОписаниеОшибки.Получить(КодСостояния);
	Если ОписаниеОшибкиТекстСоответствия <> Неопределено Тогда
		Возврат ОписаниеОшибкиТекстСоответствия;
	КонецЕсли;

	Возврат ОписаниеОшибкиТекст;

КонецФункции

&НаСервереБезКонтекста
Функция _СформироватьДетальноеОписаниеОшибки(HTTPОтвет, ТелоЗапроса = "")

	ОписаниеОшибкиТекст = _ОписаниеОшибки(HTTPОтвет.КодСостояния);
	URL 				= HTTPОтвет.URL;
	ЭтоАвторизация 		= СтрНайти(URL, "authenticate") > 0;

	Если ЗначениеЗаполнено(ТелоЗапроса) И Не ЭтоАвторизация Тогда
		ТелоЗапросаЖурнал = СтрШаблон("Тело запроса: %1%2", ТелоЗапроса, Символы.ПС);
	Иначе
		ТелоЗапросаЖурнал = "";
	КонецЕсли;

	ДетальноеОписаниеОшибки = СтрШаблон("Описание ошибки: %2%1Запрос API: %3%1%4", Символы.ПС, ОписаниеОшибкиТекст, URL, ТелоЗапросаЖурнал);

	Возврат ДетальноеОписаниеОшибки;
КонецФункции

&НаСервереБезКонтекста
Функция _РезультатОбработкиHTTPОтвета(HTTPОтвет) Экспорт

	Результат = _ОписаниеРезультатаВызоваМетодаAPI();
	КоннекторОбъект = _Коннектор(); // Вызываем _Коннектор один раз

	Результат.КодСостояния = HTTPОтвет.КодСостояния;
	Если _HTTP_OK(HTTPОтвет.КодСостояния) Тогда

		Если HTTPОтвет.Тело.Размер() > 0 Тогда
			ContentType = HTTPОтвет.Заголовки.Получить("Content-Type");
			Если ContentType = "application/octet-stream" Или ContentType = "application/zip" Или ContentType = "application/pdf" Тогда
				Результат.Данные = КоннекторОбъект.КакДвоичныеДанные(HTTPОтвет);
			Иначе
				Попытка
					Данные = КоннекторОбъект.КакJson(HTTPОтвет);
					Результат.Данные = _ФиксированныеДанные(Данные);
				Исключение
					Результат.ПроизошлаОшибка = Истина;
					Результат.ТекстОшибки = "Ошибка при разборе JSON ответа: " + ОписаниеОшибки();
				КонецПопытки;
			Результат.ОтветСервераТекст = КоннекторОбъект.КакТекст(HTTPОтвет);
			КонецЕсли;

		КонецЕсли;

	Иначе

		ОшибкаАутентификации = HTTPОтвет.КодСостояния = _HTTP_ОшибкаАутентификации();

		ДетальноеОписаниеОшибки = _СформироватьДетальноеОписаниеОшибки(HTTPОтвет);
		ОписаниеОшибкиТелоОтвета = КоннекторОбъект.КакТекст(HTTPОтвет);
		Результат.ОтветСервераТекст = ОписаниеОшибкиТелоОтвета;
		Если  ЗначениеЗаполнено(ОписаниеОшибкиТелоОтвета) Тогда
			ДетальноеОписаниеОшибки = СтрШаблон("%1; тело ответа: %2", ДетальноеОписаниеОшибки, ОписаниеОшибкиТелоОтвета);
		КонецЕсли;
		Результат.ПроизошлаОшибка = Истина;
		Результат.ТекстОшибки = ДетальноеОписаниеОшибки;

	КонецЕсли;
	Возврат Результат;

КонецФункции

&НаСервереБезКонтекста
Функция _БазовыйЗапросAPI(ТипЗапроса, Урл, Параметры = Неопределено, Json = Неопределено, Данные = Неопределено)

	Заголовки = Новый Соответствие;
	Заголовки.Вставить("Content-Type", 	  "application/json-patch+json");

	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("Заголовки", Заголовки);

	Если ЗначениеЗаполнено(Параметры) Тогда
		ДопПараметры.Вставить("ПараметрыЗапроса", Параметры);
	КонецЕсли;

	Если ЗначениеЗаполнено(Json) Тогда
		ДопПараметры.Вставить("Json", Json);
	КонецЕсли;
	Если ЗначениеЗаполнено(Данные) Тогда
		ДопПараметры.Вставить("Данные", Данные);
	КонецЕсли;

	Ответ = Неопределено;
	КоннекторОбъект = _Коннектор();
	// Вызываем _Коннектор один раз

	Если ТипЗапроса = "GET" Тогда
		Ответ = КоннекторОбъект.Get(	_Хосты().API + Урл,, ДопПараметры);
	ИначеЕсли ТипЗапроса = "POST" Тогда
		Ответ = КоннекторОбъект.Post(	_Хосты().API + Урл,, ДопПараметры);
	ИначеЕсли ТипЗапроса = "PUT" Тогда
		Ответ = КоннекторОбъект.Put(	_Хосты().API + Урл,, ДопПараметры);
	ИначеЕсли ТипЗапроса = "PATCH" Тогда
		Ответ = КоннекторОбъект.Patch(	_Хосты().API + Урл,, ДопПараметры);
	ИначеЕсли ТипЗапроса = "DELETE" Тогда
		Ответ = КоннекторОбъект.Delete(_Хосты().API + Урл,, ДопПараметры);
	Иначе
		ДетальноеОписаниеОшибки = НСтр("ru = 'Неизвестный тип HTTP-запроса'");
		// КЭДО_Сервер.ЗаписьЖурнала (предполагается, что это доступная глобальная функция)

		Результат = _ОписаниеРезультатаВызоваМетодаAPI();
		Результат.ПроизошлаОшибка = Истина;
		Результат.ТекстОшибки = ДетальноеОписаниеОшибки;

		Возврат Результат;
	КонецЕсли;
	// ТелоЗапроса для логирования формируется здесь, но не используется в _РезультатОбработкиHTTPОтвета
	// Если нужно логировать тело запроса, его следует передать в _РезультатОбработкиHTTPОтвета
	// ТелоЗапроса = ?(ЗначениеЗаполнено(Json), КоннекторОбъект.ОбъектВJson(Json), "");
	Возврат _РезультатОбработкиHTTPОтвета(Ответ);
КонецФункции

&НаСервереБезКонтекста
Функция _GetJson(Урл, Параметры = Неопределено)

	Возврат _БазовыйЗапросAPI("GET", Урл, Параметры);
КонецФункции

&НаСервереБезКонтекста
Функция _PostJson(Урл, Данные = Неопределено, Параметры = Неопределено)

	Возврат _БазовыйЗапросAPI("POST", Урл, Параметры, Данные);
КонецФункции

&НаСервереБезКонтекста
Функция _PatchJson(Урл, Данные = Неопределено, Параметры = Неопределено)

	Возврат _БазовыйЗапросAPI("PATCH", Урл, Параметры, Данные);
КонецФункции

&НаСервереБезКонтекста
Функция _PutJson(Урл, Данные = Неопределено, Параметры = Неопределено)

	Возврат _БазовыйЗапросAPI("PUT", Урл, Параметры, Данные);
КонецФункции

&НаСервереБезКонтекста
Функция _Post(Урл, Данные = Неопределено, Параметры = Неопределено)

	Возврат _БазовыйЗапросAPI("POST", Урл, Параметры,, Данные);
КонецФункции

&НаСервереБезКонтекста
Функция _Delete(Урл, Параметры = Неопределено)

	Возврат _БазовыйЗапросAPI("DELETE", Урл, Параметры);
КонецФункции

&НаСервереБезКонтекста
Функция _ДополнитьЦенами(ТаблицаИндексПортфель, ТаблицаЦен)
	Результат = _ОписаниеРезультатаВызоваМетодаAPI(); // Используем стандартный объект результата

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаИндексПортфель", ТаблицаИндексПортфель);
	Запрос.УстановитьПараметр("ТаблицаЦен", ТаблицаЦен);
	Запрос.Текст = "ВЫБРАТЬ
	|	тИП.Наименование КАК Наименование,
	|	тИП.Тикер КАК Тикер,
	|	тИП.Вес КАК Вес,
	|	тИП.Количество КАК Количество
	|ПОМЕСТИТЬ врИП
	|ИЗ
	|	&ТаблицаИндексПортфель КАК тИП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	тЦ.Тикер КАК Тикер,
	|	тЦ.Цена КАК Цена
	|ПОМЕСТИТЬ врЦ
	|ИЗ
	|	&ТаблицаЦен КАК тЦ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	врИП.Наименование КАК Наименование,
	|	врИП.Тикер КАК Тикер,
	|	врЦ.Цена КАК Цена,
	|	ЕСТЬNULL(врИП.Количество, 0) КАК Количество,
	|	ЕСТЬNULL(врЦ.Цена, 0) * ЕСТЬNULL(врИП.Количество, 0) КАК Сумма,
	|	ЕСТЬNULL(врИП.Вес, 0) КАК ВесВИндексе,
	|	0 КАК ВесВПортфеле
	|ИЗ
	|	врИП КАК врИП
	|		ЛЕВОЕ СОЕДИНЕНИЕ врЦ КАК врЦ
	|		ПО врИП.Тикер = врЦ.Тикер";
	Попытка
		ТаблицаСЦенами = Запрос.Выполнить().Выгрузить();
		Результат.Данные = ТаблицаСЦенами;
	Исключение
		Результат.ПроизошлаОшибка = Истина;
		Результат.ТекстОшибки = "Ошибка при выполнении запроса для дополнения ценами: " + ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция _ТаблицаЦен(Тикеры)
	Результат = _ОписаниеРезультатаВызоваМетодаAPI();

	ТаблицаЦен = Новый ТаблицаЗначений;
	ТаблицаЦен.Колонки.Добавить("Тикер", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(_ДлинаТикера())));
	ТаблицаЦен.Колонки.Добавить("Цена",  New ОписаниеТипов("Число", Новый КвалификаторыЧисла(_ДлинаВесаЦенаКоличество(), _ТочностьЦенаВес())));
	
	// Получаем данные по всем тикерам сразу
	// Здесь важно, что _ДанныеИнструментов уже фильтрует по TQBR
	ДанныеИнструментовРезультат = _ДанныеИнструментов(Тикеры);

	Если ДанныеИнструментовРезультат.ПроизошлаОшибка Тогда
		Результат.ПроизошлаОшибка = Истина;
		Результат.ТекстОшибки = "Ошибка при получении данных по инструментам: " + ДанныеИнструментовРезультат.ТекстОшибки;
		Возврат Результат;
	КонецЕсли;

	ДанныеВсехАкции = ДанныеИнструментовРезультат.Данные;

	Если ДанныеВсехАкции = Неопределено 
		Или ДанныеВсехАкции.Получить("marketdata") = Неопределено
		Или ДанныеВсехАкции.Получить("marketdata").Получить("columns") = Неопределено
		Или ДанныеВсехАкции.Получить("marketdata").Получить("data") = Неопределено Тогда
		Сообщить("Отсутствуют необходимые данные 'marketdata' или 'columns'/'data' в ответе.");
		Возврат Результат;
	КонецЕсли;

	Колонки = ДанныеВсехАкции.Получить("marketdata").Получить("columns");
	Данные  = ДанныеВсехАкции.Получить("marketdata").Получить("data");

	Если Колонки.Количество() = 0 Тогда
		Сообщить("Отсутствуют колонки данных 'marketdata'.");
		Возврат Результат;
	КонецЕсли;
	
	Если Данные.Количество() = 0 Тогда
		Сообщить("Отсутствуют данные 'marketdata.data'.");
		Возврат Результат;
	КонецЕсли;

	ИндексТикер  = -1;
	ИндексЦенаLast = -1;
	ИндексЦенаMarket = -1;

	// Определяем индексы колонок
	Для й = 0 По Колонки.Количество() - 1 Цикл
		Если Колонки[й] = "SECID" Тогда
			ИндексТикер = й;
		ИначеЕсли Колонки[й] = "LAST" Тогда // Нас интересует только LAST
			ИндексЦенаLast = й;
		ИначеЕсли Колонки[й] = "MARKETPRICE" Тогда
			ИндексЦенаMarket = й;
		КонецЕсли;
	КонецЦикла;

	Если ИндексТикер = -1 Тогда
		Сообщить("В полученных данных отсутствует колонка 'SECID'.");
		Возврат Результат;
	КонецЕсли;
	
	// Оставляем только проверку на 'LAST'
	Если ИндексЦенаLast = -1 Тогда
		Сообщить("В полученных данных отсутствует колонка 'LAST' для получения последней цены.");
		Возврат Результат;
	КонецЕсли;

	Для Каждого СтрокаДанных Из Данные Цикл
		Если СтрокаДанных.Количество() > ИндексТикер Тогда
			НоваяСтрока = ТаблицаЦен.Добавить();
			НоваяСтрока.Тикер = СтрокаДанных[ИндексТикер];

			Цена = 0;
            // Проверяем наличие LAST и то, что значение не Неопределено
			Если СтрокаДанных.Количество() > ИндексЦенаLast И СтрокаДанных[ИндексЦенаLast] <> Неопределено Тогда
				Цена = СтрокаДанных[ИндексЦенаLast];
			ИначеЕсли СтрокаДанных.Количество() > ИндексЦенаMarket И СтрокаДанных[ИндексЦенаMarket] <> Неопределено Тогда
				Цена = СтрокаДанных[ИндексЦенаMarket];
			КонецЕсли;
			
			НоваяСтрока.Цена = Цена;
		КонецЕсли;
	КонецЦикла;

	Результат.Данные = ТаблицаЦен;
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция _ТаблицаИндексПортфель()
	Результат = _ОписаниеРезультатаВызоваМетодаAPI();

	РезультатТаблицыИндекса = _ТаблицаПозицийИндекса();
	Если РезультатТаблицыИндекса.ПроизошлаОшибка Тогда
		Возврат РезультатТаблицыИндекса;
	КонецЕсли;
	ТаблицаИндекса = РезультатТаблицыИндекса.Данные;
	ТаблицаИндекса.Сортировать("Вес Убыв");

	РезультатТаблицыПортфеля = _ТаблицаДанныхПортфеля();
	Если РезультатТаблицыПортфеля.ПроизошлаОшибка Тогда
		Возврат РезультатТаблицыПортфеля; // Передаем ошибку выше
	КонецЕсли;
	ТаблицаПортфеля = РезультатТаблицыПортфеля.Данные;

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ТаблицаИндекса",  ТаблицаИндекса);
	Запрос.УстановитьПараметр("ТаблицаПортфеля", ТаблицаПортфеля);
	Запрос.Текст = "ВЫБРАТЬ
	|	ТИ.Наименование КАК Наименование,
	|	ТИ.Тикер КАК Тикер,
	|	ТИ.Вес КАК Вес
	|ПОМЕСТИТЬ врИ
	|ИЗ
	|	&ТаблицаИндекса КАК ТИ
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ТП.Наименование КАК Наименование,
	|	ТП.Тикер КАК Тикер,
	|	ТП.Количество КАК Количество
	|ПОМЕСТИТЬ врП
	|ИЗ
	|	&ТаблицаПортфеля КАК ТП
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЕСТЬNULL(вИ.Наименование, вП.Наименование) КАК Наименование,
	|	ЕСТЬNULL(вИ.Тикер, вП.Тикер) КАК Тикер,
	|	ЕСТЬNULL(вИ.Вес, 0) КАК Вес,
	|	ЕСТЬNULL(вП.Количество, 0) КАК Количество
	|ИЗ
	|	врИ КАК вИ
	|		ПОЛНОЕ СОЕДИНЕНИЕ врП КАК вП
	|		ПО вИ.Тикер = вП.Тикер";
	Попытка
		РезультирующаяТаблица = Запрос.Выполнить().Выгрузить();
		Результат.Данные = РезультирующаяТаблица;
	Исключение
		Результат.ПроизошлаОшибка = Истина;
		Результат.ТекстОшибки = "Ошибка при выполнении запроса для объединения данных индекса и портфеля: " + ОписаниеОшибки();
	КонецПопытки;

	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция _ТаблицаДанныхПортфеля()
	Результат = _ОписаниеРезультатаВызоваМетодаAPI();

	ТаблицаПортфеля = Новый ТаблицаЗначений;
	ТаблицаПортфеля.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(_ДлинаНаименования())));
	ТаблицаПортфеля.Колонки.Добавить("Тикер", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(_ДлинаТикера())));
	ТаблицаПортфеля.Колонки.Добавить("Количество", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(_ДлинаВесаЦенаКоличество(), 0)));
	// Целое число

	// Пример загрузки данных из жестко закодированной строки.
	// В реальной системе это может быть чтение из файла, запроса к БД или веб-сервиса.
	ДанныеПортфеляСтрокой = "ЛУКОЙЛ;LKOH;67
	|Газпром;GAZP;2640
	|Сбер Банк;SBER;1400
	|Татнефть;TATN;284
	|Т-Техно;T;37
	|НОВАТЭК;NVTK;114
	|Yandex;YDEX;26
	|Норильский никель;GMKN;1500
	|Роснефть;ROSN;218
	|Полюс золото;PLZL;60
	|Сбер Банк (прив.);SBERP;240
	|Сургутнефтегаз;SNGS;3500
	|Сургутнефтегаз (прив.);SNGSP;1200
	|Северсталь;CHMF;37
	|НЛМК;NLMK;310
	|Московская биржа;MOEX;200
	|Интер РАО ЕЭС;IRAO;10400
	|РУСАЛ;RUAL;1300
	|ПИК;PIKK;62
	|Татнефть (прив.);TATNP;55
	|Алроса;ALRS;520
	|Магнит;MGNT;19
	|ММК;MAGN;580
	|МКБ;CBOM;1500
	|ФосАгро;PHOR;3
	|Транснефть;TRNFP;100
	|OZON-адр;OZON;10
	|Корп. Центр X5;X5;14";
	// Разбираем строки и заполняем таблицу
	СтрокиДанных = СтрРазделить(ДанныеПортфеляСтрокой, Символы.ПС, Ложь);
	Для Каждого СтрокаТекста Из СтрокиДанных Цикл
		Если ЗначениеЗаполнено(СтрокаТекста) Тогда
			ЧастиСтроки = СтрРазделить(СтрокаТекста, ";", Ложь);
			Если ЧастиСтроки.Количество() = 3 Тогда
				НоваяСтрока = ТаблицаПортфеля.Добавить();
				НоваяСтрока.Наименование = СокрЛП(ЧастиСтроки[0]); // Обрезаем пробелы
				НоваяСтрока.Тикер = СокрЛП(ЧастиСтроки[1]);
				Попытка
					НоваяСтрока.Количество = Число(СокрЛП(ЧастиСтроки[2]));
				Исключение
					Сообщить("Ошибка преобразования количества для " + НоваяСтрока.Наименование + ". Установлено 0.");
					НоваяСтрока.Количество = 0;
				КонецПопытки;
			Иначе
				Сообщить("Некорректный формат строки данных портфеля: " + СтрокаТекста);
			КонецЕсли;
		КонецЕсли;
	КонецЦикла;

	Результат.Данные = ТаблицаПортфеля;
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция _ТаблицаПозицийИндекса()
	Результат = _ОписаниеРезультатаВызоваМетодаAPI();

	ТаблицаПозиций = Новый ТаблицаЗначений;
	ТаблицаПозиций.Колонки.Добавить("Тикер", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(_ДлинаТикера())));
	ТаблицаПозиций.Колонки.Добавить("Наименование", Новый ОписаниеТипов("Строка", Новый КвалификаторыСтроки(_ДлинаНаименования())));
	ТаблицаПозиций.Колонки.Добавить("Вес", Новый ОписаниеТипов("Число", Новый КвалификаторыЧисла(_ДлинаВесаЦенаКоличество(), _ТочностьЦенаВес())));
	ПараметрыЗапроса = Новый Структура;

	ТекущееСмещение = 0;
	ОбщееКоличество = -1;
	РазмерСтраницы  = 20;

	Пока ТекущееСмещение < ОбщееКоличество Или ОбщееКоличество = -1 Цикл

		Если ОбщееКоличество <> -1 Тогда
			ПараметрыЗапроса.Вставить("start", ТекущееСмещение);
		КонецЕсли;

		ПорцияИндекса = _ДанныеИндекса("IMOEX", ПараметрыЗапроса);

		Если ПорцияИндекса.ПроизошлаОшибка Тогда
			Результат.ПроизошлаОшибка = Истина;
			Результат.ТекстОшибки = "Ошибка при получении данных индекса: " + ПорцияИндекса.ТекстОшибки;
			Возврат Результат;
		КонецЕсли;

		ДанныеПорции = ПорцияИндекса.Данные.Получить("analytics");
		Если ДанныеПорции = Неопределено Тогда
			Результат.ПроизошлаОшибка = Истина;
			Результат.ТекстОшибки = "Ошибка: Отсутствует ключ 'analytics' в ответе сервера при получении данных индекса.";
			Возврат Результат;
		КонецЕсли;

		МассивПозиций = ДанныеПорции.Получить("data");
		Если МассивПозиций = Неопределено Тогда
			Результат.ПроизошлаОшибка = Истина;
			Результат.ТекстОшибки = "Ошибка: Отсутствует ключ 'data' в 'analytics' при получении данных индекса.";
			Возврат Результат;
		КонецЕсли;

		// Обновляем общее количество данных и текущее смещение после первой порции
		Если ОбщееКоличество = -1 Тогда
			КурсорДанные = ПорцияИндекса.Данные.Получить("analytics.cursor");
			Если КурсорДанные <> Неопределено И КурсорДанные.Получить("data").Количество() > 0 Тогда
				ОбщееКоличество = КурсорДанные.Получить("data")[0][1]; // TOTAL
				РазмерСтраницы = КурсорДанные.Получить("data")[0][2]; // PAGESIZE
			Иначе
				Результат.ПроизошлаОшибка = Истина;
				Результат.ТекстОшибки = "Ошибка: Не удалось получить данные курсора (TOTAL, PAGESIZE) при получении данных индекса.";
				Возврат Результат;
			КонецЕсли;
		КонецЕсли;
		Для Каждого Позиция ИЗ МассивПозиций Цикл
			// Проверяем тип и достаточное количество элементов, используя функции вместо констант
			Если ТипЗнч(Позиция) = Тип("ФиксированныйМассив") И Позиция.Количество() > _ИндексВес_IMOEX() Тогда
				НоваяСтрока = ТаблицаПозиций.Добавить();
				НоваяСтрока.Тикер       = Позиция[_ИндексТикер_IMOEX()];
				НоваяСтрока.Наименование = Позиция[_ИндексНаименование_IMOEX()];
				НоваяСтрока.Вес         = Позиция[_ИндексВес_IMOEX()];
			Иначе
				Сообщить("Внимание: Некорректный формат позиции в данных индекса.");
			КонецЕсли;
		КонецЦикла;
		ТекущееСмещение = ТекущееСмещение + РазмерСтраницы;

	КонецЦикла;

	Результат.Данные = ТаблицаПозиций;
	Возврат Результат;
КонецФункции

&НаСервереБезКонтекста
Функция _ДанныеИндекса(ИмяИндекса, ПараметрыЗапроса)

	ШаблонПути = "/iss/statistics/engines/stock/markets/index/analytics/%1.json";
	Урл = СтрШаблон(ШаблонПути, ИмяИндекса);
	Возврат _GetJson(Урл, ПараметрыЗапроса);

КонецФункции

&НаСервереБезКонтекста
Функция _ДанныеИнструмента(Тикер)

	ШаблонПути = "/iss/engines/stock/markets/shares/boards/TQBR/securities/%1.json";
	Урл = СтрШаблон(ШаблонПути, Тикер);

	Возврат _GetJson(Урл);

КонецФункции

&НаСервереБезКонтекста
Функция _ДанныеИнструментов(Тикеры)
	
	ТикерыСтрокой = СтрСоединить(Тикеры, ",");
	Параметры = Новый Соответствие;
	Параметры.Вставить("securities", ТикерыСтрокой);
	Параметры.Вставить("iss.meta",   "off");
	Параметры.Вставить("iss.data",   "on");
	Параметры.Вставить("iss.only",   "marketdata");

	Урл = "/iss/engines/stock/markets/shares/boards/TQBR/securities.json";
	
	Возврат _GetJson(Урл, Параметры);
	
КонецФункции

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ПолучитьИндекс(Команда)
	ПолучитьИндексНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПолучитьИндексНаСервере()

	РезультатТаблицыИндексПортфель = _ТаблицаИндексПортфель();
	Если РезультатТаблицыИндексПортфель.ПроизошлаОшибка Тогда
		Сообщить("Ошибка при получении данных портфеля: " + РезультатТаблицыИндексПортфель.ТекстОшибки);
		Возврат;
	КонецЕсли;
	ТаблицаИндексПортфель = РезультатТаблицыИндексПортфель.Данные;
	Если ТаблицаИндексПортфель.Количество() = 0 Тогда
		Сообщить("В портфеле нет позиций для обработки.");
		Возврат;
	КонецЕсли;

	Тикеры = ТаблицаИндексПортфель.ВыгрузитьКолонку("Тикер");
	
	РезультатТаблицыЦен = _ТаблицаЦен(Тикеры);
	Если РезультатТаблицыЦен.ПроизошлаОшибка Тогда
		Сообщить("Ошибка при получении цен акций: " + РезультатТаблицыЦен.ТекстОшибки);
		Возврат;
	КонецЕсли;
	ТаблицаЦен = РезультатТаблицыЦен.Данные;

	РезультатТаблицыСЦенами = _ДополнитьЦенами(ТаблицаИндексПортфель, ТаблицаЦен);
	Если РезультатТаблицыСЦенами.ПроизошлаОшибка Тогда
		Сообщить("Ошибка при дополнении данных ценами: " + РезультатТаблицыСЦенами.ТекстОшибки);
		Возврат;
	КонецЕсли;
	ТаблицаСЦенами = РезультатТаблицыСЦенами.Данные;

	СуммаПортфеляАкций = ТаблицаСЦенами.Итог("Сумма");

	Для Каждого СтрокаТаблицы Из ТаблицаСЦенами Цикл
		Если СуммаПортфеляАкций <> 0 Тогда
			СтрокаТаблицы.ВесВПортфеле = (СтрокаТаблицы.Сумма / СуммаПортфеляАкций) * 100;
		Иначе
			СтрокаТаблицы.ВесВПортфеле = 0;
		КонецЕсли;
	КонецЦикла;

	ИтоговаяТаблица.Загрузить(ТаблицаСЦенами);
	
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьИнструментыНаСервере()
	
	Для Каждого Инструмент Из ИтоговаяТаблица Цикл
		
		НовыйИнструмент = Справочники.УП_БиржевыеИнструменты.СоздатьЭлемент();
		НовыйИнструмент.Наименование = Инструмент.Наименование;
		НовыйИнструмент.Код = Инструмент.Тикер;
		
		НовыйИнструмент.Записать();
		
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьИнструменты(Команда)
	ЗаполнитьИнструментыНаСервере();
КонецПроцедуры

&НаСервере
Процедура ТестАпиНаСервере()
	
	ЗапросТикеров = Новый Запрос;
	ЗапросТикеров.Текст = "ВЫБРАТЬ РАЗЛИЧНЫЕ
	|	УП_ИндексыСостав.Инструмент КАК Ссылка
	|ПОМЕСТИТЬ врИнструменты
	|ИЗ
	|	Справочник.УП_Индексы.Состав КАК УП_ИндексыСостав
	|
	|ОБЪЕДИНИТЬ
	|
	|ВЫБРАТЬ
	|	УП_ПортфелиСостав.Инструмент
	|ИЗ
	|	Справочник.УП_Портфели.Состав КАК УП_ПортфелиСостав
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	БИ.Код КАК Тикер
	|ИЗ
	|	врИнструменты КАК врИнструменты
	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УП_БиржевыеИнструменты КАК БИ
	|		ПО (БИ.Ссылка = врИнструменты.Ссылка)";
	
	Тикеры = ЗапросТикеров.Выполнить().Выгрузить().ВыгрузитьКолонку("Тикер");
	
	Клиент = Обработки.УП_КлиентМосбиржи.Создать().Инит();
	Данные = Клиент.ДанныеИнструментов(Тикеры);
	
КонецПроцедуры

&НаКлиенте
Процедура ТестАпи(Команда)
	ТестАпиНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗаполнитьЦеныНаСервере()
	РегистрыСведений.УП_ЦеныИнструментов.ЗаполнитьЦены();
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьЦены(Команда)
	ЗаполнитьЦеныНаСервере();
КонецПроцедуры

#КонецОбласти
